{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,35],"dtype":"float32"}},{"class_name":"Dense","config":{"units":2048,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}},{"class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true}},{"class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true}}],"keras_version":"tfjs-layers 0.6.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./re-improve.model.json.weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[35,256],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[256,2048],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[2048],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[2048,1024],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[1024,512],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[512,256],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[64,3],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[3],"dtype":"float32"}]}]}