{"modelTopology":{"class_name":"Sequential","config":{"name":"2048-move-network","layers":[{"class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"input","trainable":true,"batch_input_shape":[null,16],"dtype":"float32"}},{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"hidden-1","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"hidden-2","trainable":true}},{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"hidden-3","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"output","trainable":true}}]},"keras_version":"tfjs-layers 2.0.1","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.0.1","convertedBy":null,"weightsManifest":[{"paths":["./re-improve.model.weights.bin"],"weights":[{"name":"input/kernel","shape":[16,512],"dtype":"float32"},{"name":"input/bias","shape":[512],"dtype":"float32"},{"name":"hidden-1/kernel","shape":[512,32],"dtype":"float32"},{"name":"hidden-1/bias","shape":[32],"dtype":"float32"},{"name":"hidden-2/kernel","shape":[32,64],"dtype":"float32"},{"name":"hidden-2/bias","shape":[64],"dtype":"float32"},{"name":"hidden-3/kernel","shape":[64,128],"dtype":"float32"},{"name":"hidden-3/bias","shape":[128],"dtype":"float32"},{"name":"output/kernel","shape":[128,4],"dtype":"float32"},{"name":"output/bias","shape":[4],"dtype":"float32"}]}]}